{
  "description": {
    "title": "StarFleet Project — Платформа для моніторингу та управління інформаційними системами",
    "intro": "<strong>StarFleet Project</strong> — це open-source фреймворк, створений для побудови систем моніторингу та управління різними інформаційними системами. Під час розробки архітектури та вибору технологій ми орієнтувалися на низький поріг входження для нових розробників, що дозволяє легко розпочати участь у проєкті. Для забезпечення високої надійності та масштабованості рішення ми використовували перевірені технології, такі як <mark>Node.js</mark>, <mark>Next.js</mark>, <mark>React.js</mark>, <mark>Docker</mark> та <mark>Nginx</mark>.",
    "components_title": "Основні компоненти StarFleet Project",
    "components_text": "Основною рушійною силою <mark>StarFleet Project</mark> є розробники плагінів. Ми впевнені, що успіх StarFleet безпосередньо залежить від спільноти, і саме вам, розробникам плагінів, ми зобов'язані нашим розвитком. За допомогою StarFleet Plugins ви можете розширювати функціональність системи як на Frontend, так і на Backend. Проєкт надає гнучкість у виборі інструментів і фреймворків для створення плагінів, будь то <mark>React</mark>, <mark>Vue</mark>, <mark>Angular</mark> або інші.",
    "module_federation": "Система інтеграції плагінів працює через технологію <mark>Module Federation</mark> (Webpack), що дозволяє плагінам бути незалежними та динамічно завантажуватися в основний додаток. Розробка плагінів з мінімальними зусиллями: StarFleet майже не обмежує вас у виборі інструментів, але водночас надає готові скрипти та приклади коду, які допоможуть навіть початківцям розробникам створювати плагіни з мінімальними витратами часу.",
    "integration_title": "Інтеграція плагінів у ядро StarFleet",
    "integration_intro": "Ядро StarFleet Project є основою для взаємодії плагінів і надає кілька ключових сервісів та інструментів:",
    "integration_auth": "Аутентифікація та авторизація для захисту системи.",
    "integration_storage": "Сервіс зберігання даних у форматі ключ-значення для обміну даними між плагінами.",
    "integration_messaging": "Механізми передачі повідомлень між плагінами на Frontend та Backend.",
    "integration_styling": "Стилізаційні компоненти для React.js, які допоможуть вам створювати інтерфейси в єдиному стилі та скоротять час на пошук компонентів.",
    "scalability_title": "Масштабованість і гнучкість",
    "scalability_intro": "Проєкт надає дві основні збірки для розробки та розгортання:",
    "scalability_docker": "<mark>Docker</mark> — контейнеризація та розгортання у різних середовищах.",
    "scalability_lerna": "<mark>Lerna Monorepo</mark> — використовується для динамічної розробки та керування плагінами. Розгортає плагіни як незалежні додатки на різних портах.",
    "documentation_title": "Приклади коду та документація",
    "documentation_text": "Ми також надаємо розширену документацію та приклади коду, які допоможуть вам вирішити більшість поширених завдань, таких як агрегація даних із third-party систем. Ці приклади та готові рішення дозволять вам зосередитися на бізнес-логіці, а не на реалізації складних технічних деталей.",
    "final_text": "<strong>StarFleet Project</strong> прагне зробити створення плагінів простим і доступним для всіх, забезпечуючи надійну та масштабовану платформу для моніторингу та управління інформаційними системами."
  },
  "structure": {
    "title": "Структура проєкту",
    "intro": "Проєкт організований у вигляді монорепозиторію з використанням <mark>Lerna</mark> та <mark>yarn workspaces</mark>.",
    "list_item_1": "<mark>core/</mark> – це основний інтерфейс, написаний на Next.js. У ньому знаходяться сторінки, API-роути, базова логіка додатка.",
    "list_item_2": "<mark>plugins/</mark> – каталог для плагінів. Кожен плагін є окремим модулем і може бути написаний на будь-якому фреймворку (React, Vue, Angular). Підключення плагінів реалізовано через Webpack Module Federation.",
    "list_item_3": "<mark>scripts/</mark> – скрипти для збірки, керування плагінами та автоматизації розгортання."
  },
  "install_and_run": {
    "title": "Встановлення та запуск",
    "installDependencies": "🛠 Встановлення залежностей",
    "installDescription": "За замовчуванням, при використанні <mark>Lerna</mark>, скрипт <mark>Next.js</mark> (core) запускатиметься за адресою <a href='#'>http://localhost:3000</a>. Плагіни будуть доступні на портах <mark>3001</mark>, <mark>3002</mark> і так далі. Перед запуском переконайтеся, що ці порти вільні. Також надається скрипт для завершення процесів, що використовують ці порти. Будьте обережні та переконайтеся, що серед них немає важливих процесів.",
    "note": "* Ми рекомендуємо використовувати Yarn як менеджер пакетів, оскільки він пропонує більше можливостей для роботи з монорепозиторіями.",
    "runProject": "🛠 Запуск проєкту в режимі розробки",
    "createPlugin": "🔌 Як створити та підключити новий плагін?",
    "cliUsage": "1. Використання <mark>starfleet-cli</mark>",
    "cliDescription": "Для зручності ми створили <mark>npm-скрипт</mark> <a href='https://www.npmjs.com/package/starfleet-cli' target='_blank'>starfleet-cli</a>, який автоматично генерує структуру нового плагіна, видаляє, перейменовує та підключає його до ядра StarFleet.",
    "cliExample": "Приклад використання",
    "cliProcess": "Далі плагін поставить кілька запитань для створення нового плагіна та застосування шаблону за замовчуванням. (У цьому прикладі створюється React-шаблон на порту <mark>3004</mark>).",
    "cliProcessNote": "Вы повинні розуміти порти для локальноі розробки не повинні перетинатися. Наприклад якшо порт 3001 чи 3002 вже використовується, ви можете вибрати інший порт. Доступні порти (3001-3999)",
    "manualSetup": "2. Ручне налаштування",
    "manualDescription": "Якщо ви хочете створити плагін вручну, виконайте такі кроки:",
    "step1": "1. Створіть папку у <mark>plugins</mark> з назвою вашого плагіна та перейдіть у неї.",
    "step2": "2. Ініціалізуйте новий package.json:"
  },
  "docker_info": {
    "title": "Використання Docker для запуску проєкту (в розробці)",
    "description": "Docker дозволяє запускати ядро StarFleet Project і всі плагіни всередині контейнерів, забезпечуючи ізоляцію середовища та зручне розгортання.",
    "stepsTitle": "Кроки для запуску проєкту в Docker",
    "step1": "Переконайтесь, що у вас встановлений ",
    "step2": "Зберіть образи Docker в корені проєкту, виконайте команди:",
    "step3": "(Опційно) Запустіть контейнери, якщо вони не запущені:",
    "structureTitle": "Структура Docker-контейнерів",
    "containerCore": "core",
    "containerCoreDescription": "Контейнер з основним інтерфейсом на Next.js",
    "containerPluginA": "plugin-a",
    "containerPluginB": "plugin-b, …",
    "containerPluginsDescription": "Контейнери з підключеними плагінами",
    "containerNginx": "nginx",
    "containerNginxDescription": "Реверс-проксі для управління запитами між контейнерами.",
    "step4": "За замовчуванням проєкт запуститься на",
    "step4Description": "а плагіни будуть доступні тільки всередині контейнера"
  }
}
